Tekla Open API Reference for Tekla Structures 2025
PourBreak Properties
The PourBreak type exposes the following members.
Properties
Name | Description
Identifier
 The identifier of the object.
 (Inherited from Object.)
IsUpToDate
Gets if the object does not have a modification which is not shared.
 (Inherited from ModelObject.)
ModificationTime
Gets latest time of the object was modified or created.
 (Inherited from ModelObject.)
Polymesh
 Gets or sets the polymesh that forms the object geometry.
Top
See Also
Reference
PourBreak Class
Tekla.Structures.Model Namespace